#Modified version of the original code from Hu et al., CVPR 2017
#
#@author Hu et al.
#@author Christian Wilms
#@date 01/05/21

name: 'Single Shot Mask - ResNet 50'

layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "objAttMask_8"
  top: "objAttMask_16"
  top: "objAttMask_24"
  top: "objAttMask_32"
  top: "objAttMask_48"
  top: "objAttMask_64"
  top: "objAttMask_96"
  top: "objAttMask_128"
  top: "objAttMask_8_org"
  top: "objAttMask_16_org"
  top: "objAttMask_24_org"
  top: "objAttMask_32_org"
  top: "objAttMask_48_org"
  top: "objAttMask_64_org"
  top: "objAttMask_96_org"
  top: "objAttMask_128_org"
  python_param {
    module: "data.layers"
    layer: "COCOSSMSpiderAttentionMask8_128"
  }
}

layer {
  name: "ResNetnConv2dnconv1n183"
  type: "Convolution"
  bottom: "data"
  top: "ResNetnConv2dnconv1n183"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 2
    pad_h: 3
    pad_w: 3
    kernel_h: 7
    kernel_w: 7
  }
}

layer {
  name: "ResNetnBatchNorm2dnbn1n184"
  type: "BatchNorm"
  bottom: "ResNetnConv2dnconv1n183"
  top: "ResNetnBatchNorm2dnbn1n184"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnBatchNorm2dnbn1n184_scale"
  type: "Scale"
  bottom: "ResNetnBatchNorm2dnbn1n184"
  top: "ResNetnBatchNorm2dnbn1n184"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnReLUnrelun185"
  type: "ReLU"
  bottom: "ResNetnBatchNorm2dnbn1n184"
  top: "ResNetnBatchNorm2dnbn1n184"
}

layer {
  name: "ResNetnMaxPool2dnmaxpooln186"
  type: "Pooling"
  bottom: "ResNetnBatchNorm2dnbn1n184"
  top: "ResNetnMaxPool2dnmaxpooln186"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n187"
  type: "Convolution"
  bottom: "ResNetnMaxPool2dnmaxpooln186"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n187"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n187"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun189"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n190"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n188"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n190"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n190"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n191"
  bottom: "ResNetnMaxPool2dnmaxpooln186"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun193"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n194"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n194"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n194"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun196"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n197"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n195"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n197"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n197"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n198"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n192"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun200"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n201"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n201"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n201"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun203"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n204"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n202"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n204"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n204"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n205"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n199"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun207"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n208"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n208"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n213"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n206"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n213"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n208"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n213"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun210"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n211"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n209"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n211"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n211"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n212"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n214"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun216"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n217"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n217"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n217"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun219"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n220"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n218"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n220"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n220"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n221"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n215"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun223"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n224"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n224"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n224"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun226"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n227"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n225"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n227"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n227"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n228"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n222"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun230"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv1n231"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv1n231"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv1n231"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnReLUnrelun233"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv2n234"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn1n232"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv2n234"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnConv2dnconv2n234"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3nnBatchNorm2dnbn2n235"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n229"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn3nnReLUnrelun237"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  top: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
}

####################### div2 ###########################


layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun240"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n241"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n241"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n241"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n242"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun246"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n247"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n247"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n247"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun249"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n250"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n248"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n250"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n250"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n251"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n245"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun253"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n254"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n254"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n254"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun256"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n257"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n255"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n257"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n257"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n258"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n252"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun260"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv1n261"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv1n261"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv1n261"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnReLUnrelun263"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv2n264"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn1n262"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv2n264"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnConv2dnconv2n264"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3nnBatchNorm2dnbn2n265"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n259"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn3nnReLUnrelun267"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
  top: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv1n268"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv1n268"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv1n268"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnReLUnrelun270"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv2n271"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn1n269"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv2n271"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnConv2dnconv2n271"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4nnBatchNorm2dnbn2n272"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn3n266"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn4nnReLUnrelun274"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
  top: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv1n275"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv1n275"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv1n275"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnReLUnrelun277"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv2n278"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn1n276"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv2n278"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnConv2dnconv2n278"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5n280"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5nnBatchNorm2dnbn2n279"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn4n273"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5n280"
  eltwise_param {
    operation: SUM
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn5nnReLUnrelun281"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn5n280"
  top: "ResNetnSequentialnlayer3nnBasicBlockn5n280"
}


####################### div2 ###########################


layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238_div3"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238_div3"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 3
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243_div3"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn3n236"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243_div3"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 3
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_div3"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n238_div3"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_div3"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_scale_div3"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_div3"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n239_div3"
  scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244_div3"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n243_div3"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n244_div3"
  batch_norm_param {
        use_global_stats: true
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
    }
    param {
        lr_mult: 0.0
        decay_mult: 0.0
}
}

layer {
